app/controllers/api/answers_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "answers" ("body", "question_id", "answerer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "because I'm an asshole"], ["question_id", 1], ["answerer_id", 2], ["created_at", "2015-11-20 16:51:41.318483"], ["updated_at", "2015-11-20 16:51:41.318483"]]
---
  def create
    @question = Question.find(params[:question_id])
    @answer = @question.answers.new(answer_params)
    @answer.answerer = current_user
    if @answer.save!