app/controllers/api/questions_controller.rb

  def index
    @questions = Question.all.includes(:asker)
---
SELECT "questions".* FROM "questions"

  def show
    @question = Question.includes(:asker).includes(answers: [:answerer]).find(params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @question = current_user.questions.new(question_params)
    if @question.save!
---
INSERT INTO "questions" ("title", "body", "asker_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Does this work?"], ["body", "I sure hope so, otherwise you're fucked"], ["asker_id", 1], ["created_at", "2015-11-18 15:49:24.764112"], ["updated_at", "2015-11-18 15:49:24.764112"]]

  def update
    @question = Question.find(params[:id])
    if params[:acceptedId]
      @question.answered = true
      answer = @question.answers.find(params[:acceptedId]).accepted = true
      @question.save!
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1 AND "answers"."id" = $2 LIMIT 1  [["question_id", 1], ["id", 1]]
UPDATE "questions" SET "answered" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["answered", "t"], ["updated_at", "2015-11-24 23:00:18.692099"], ["id", 1]]